podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/ADC_LPC82x.svd.xml
            <register>
               <name>CHAN_THRSEL</name>
               <description>A/D Channel-Threshold Select Register. Specifies which set of threshold compare registers are to be used for each channel</description>
               <addressOffset>0x60</addressOffset>
               <fields>
                  <field>
                     <name>CH0_THRSEL</name>
                     <description>Threshold select by channel</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>THRESHOLD_0</name>
                           <description>Threshold 0. Channel 0 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THRESHOLD_1</name>
                           <description>Threshold 1. Channel 0 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CH1_THRSEL</name>
                     <description>Threshold select by channel</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>THRESHOLD_0</name>
                           <description>Threshold 0. Channel 1 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THRESHOLD_1</name>
                           <description>Threshold 1. Channel 1 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CH2_THRSEL</name>
                     <description>Threshold select by channel</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>THRESHOLD_0</name>
                           <description>Threshold 0. Channel 2 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THRESHOLD_1</name>
                           <description>Threshold 1. Channel 2 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CH3_THRSEL</name>
                     <description>Threshold select by channel</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>THRESHOLD_0</name>
                           <description>Threshold 0. Channel 3 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THRESHOLD_1</name>
                           <description>Threshold 1. Channel 3 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CH4_THRSEL</name>
                     <description>Threshold select by channel</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>THRESHOLD_0</name>
                           <description>Threshold 0. Channel 4 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THRESHOLD_1</name>
                           <description>Threshold 1. Channel 4 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CH5_THRSEL</name>
                     <description>Threshold select by channel</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>THRESHOLD_0</name>
                           <description>Threshold 0. Channel 5 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THRESHOLD_1</name>
                           <description>Threshold 1. Channel 5 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CH6_THRSEL</name>
                     <description>Threshold select by channel</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>THRESHOLD_0</name>
                           <description>Threshold 0. Channel 6 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THRESHOLD_1</name>
                           <description>Threshold 1. Channel 6 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CH7_THRSEL</name>
                     <description>Threshold select by channel</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>THRESHOLD_0</name>
                           <description>Threshold 0. Channel 7 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THRESHOLD_1</name>
                           <description>Threshold 1. Channel 7 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CH8_THRSEL</name>
                     <description>Threshold select by channel</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>THRESHOLD_0</name>
                           <description>Threshold 0. Channel 8 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THRESHOLD_1</name>
                           <description>Threshold 1. Channel 8 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CH9_THRSEL</name>
                     <description>Threshold select by channel</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>THRESHOLD_0</name>
                           <description>Threshold 0. Channel 9 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THRESHOLD_1</name>
                           <description>Threshold 1. Channel 9 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CH10_THRSEL</name>
                     <description>Threshold select by channel</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>THRESHOLD_0</name>
                           <description>Threshold 0. Channel 10 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THRESHOLD_1</name>
                           <description>Threshold 1. Channel 10 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CH11_THRSEL</name>
                     <description>Threshold select by channel</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>THRESHOLD_0</name>
                           <description>Threshold 0. Channel 11 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THRESHOLD_1</name>
                           <description>Threshold 1. Channel 11 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTEN</name>
               <description>A/D Interrupt Enable Register. This register contains enable bits that enable the sequence-A, sequence-B, threshold compare and data overrun interrupts to be generated</description>
               <addressOffset>0x64</addressOffset>
               <fields>
                  <field>
                     <name>SEQA_INTEN</name>
                     <description>Sequence A interrupt enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Disabled. The sequence A interrupt/DMA trigger is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Enabled. The sequence A interrupt/DMA trigger is enabled and will be asserted either upon completion of each individual conversion performed as part of sequence A, or upon completion of the entire A sequence of conversions, depending on the MODE bit in the SEQA_CTRL register</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SEQB_INTEN</name>
                     <description>Sequence B interrupt enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Disabled. The sequence B interrupt/DMA trigger is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Enabled. The sequence B interrupt/DMA trigger is enabled and will be asserted either upon completion of each individual conversion performed as part of sequence B, or upon completion of the entire B sequence of conversions, depending on the MODE bit in the SEQB_CTRL register</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OVR_INTEN</name>
                     <description>Overrun interrupt enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Disabled. The overrun interrupt is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Enabled. The overrun interrupt is enabled. Detection of an overrun condition on any of the 12 channel data registers will cause an overrun interrupt request. In addition, if the MODE bit for a particular sequence is 0, then an overrun in the global data register for that sequence will also cause this interrupt request to be asserted</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADCMPINTEN0</name>
                     <description>Threshold comparison interrupt enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OUTSIDE_THRESHOLD</name>
                           <description>Outside threshold</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CROSSING_THRESHOLD</name>
                           <description>Crossing threshold</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ADCMPINTEN0" > <name>ADCMPINTEN1</name> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="ADCMPINTEN0" > <name>ADCMPINTEN2</name> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="ADCMPINTEN0" > <name>ADCMPINTEN3</name> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="ADCMPINTEN0" > <name>ADCMPINTEN4</name> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="ADCMPINTEN0" > <name>ADCMPINTEN5</name> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="ADCMPINTEN0" > <name>ADCMPINTEN6</name> <bitOffset>15</bitOffset> </field>
                  <field derivedFrom="ADCMPINTEN0" > <name>ADCMPINTEN7</name> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="ADCMPINTEN0" > <name>ADCMPINTEN8</name> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="ADCMPINTEN0" > <name>ADCMPINTEN9</name> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="ADCMPINTEN0" > <name>ADCMPINTEN10</name> <bitOffset>23</bitOffset> </field>
                  <field derivedFrom="ADCMPINTEN0" > <name>ADCMPINTEN11</name> <bitOffset>25</bitOffset> </field>
               </fields>
            </register>
